[
    {
        "Plant Name": "Aloevera",
        "Location": "Aloe vera thrives in arid and semi-arid regions, commonly found in tropical and subtropical climates like India, Mexico, and the Mediterranean. It prefers well-drained, sandy soils and sunny environments, often cultivated in home gardens or commercially in dry areas. Native to the Arabian Peninsula, it’s now grown globally due to its medicinal value. Its ability to store water in succulent leaves allows it to survive prolonged droughts, making it ideal for xeriscaping. In India, it’s abundant in Rajasthan and Gujarat, where warm temperatures and minimal rainfall create perfect conditions for its growth.",
        "Diseases Treated": "Aloe vera is renowned for treating skin conditions like burns, wounds, and eczema due to its anti-inflammatory and antimicrobial properties. Its gel soothes sunburn, promotes wound healing, and reduces acne. Internally, it aids digestion, alleviating constipation and irritable bowel syndrome. Aloe’s antioxidants may boost immunity and lower blood sugar in diabetics. It’s used in Ayurveda for cooling effects, treating ulcers, and improving skin complexion. The gel’s hydrating properties help with dry skin and psoriasis. Some studies suggest it may reduce dental plaque when used as a mouthwash, offering oral health benefits.",
        "Preparation Methods": "Aloe vera gel is extracted by slicing open the leaf and scooping out the clear pulp. For skin conditions, apply fresh gel directly to burns, wounds, or acne for 15-20 minutes daily. For digestion, mix 1-2 tablespoons of gel in water or juice, consumed once daily. In Ayurveda, aloe is blended with honey for ulcers or made into a paste with turmeric for skin issues. To make a face mask, combine gel with lemon juice and apply for 10 minutes. Always use fresh gel, as commercial products may contain additives reducing efficacy."
    },
    {
        "Plant Name": "Amla",
        "Location": "Amla, or Indian gooseberry (Phyllanthus emblica), is native to tropical and southern Asia, thriving in India, Sri Lanka, and Southeast Asia. It grows in deciduous forests, plains, and hilly regions, preferring fertile, loamy soils with moderate rainfall. In India, it’s widespread in Uttar Pradesh, Tamil Nadu, and Rajasthan, often found in mixed forests or cultivated orchards. The small to medium-sized tree tolerates a range of climates, from subtropical to tropical, and is grown commercially for its fruit. Its adaptability makes it a staple in Ayurvedic gardens and rural landscapes.",
        "Diseases Treated": "Amla is a potent antioxidant, rich in vitamin C, used to boost immunity and combat infections. It treats high cholesterol by reducing LDL and triglycerides, supporting heart health. Amla aids digestion, relieving constipation and acidity, and is effective against diabetes by regulating blood sugar. Its anti-inflammatory properties help with arthritis and joint pain. In Ayurveda, it’s used for hair health, preventing hair loss and dandruff, and for skin rejuvenation, reducing wrinkles. Amla also supports eye health, improving vision, and may prevent cancers due to its antitumor properties.",
        "Preparation Methods": "Amla fruit is consumed raw, dried, or as juice. For immunity, eat 1-2 fresh amlas daily or drink 20 ml of amla juice mixed with water. To lower cholesterol, take 1 teaspoon of dried amla powder with warm water twice daily. For hair, massage amla oil (boiled with coconut oil) into the scalp weekly. In Ayurveda, amla is pickled with salt and spices or made into chyavanprash, a jam taken daily for rejuvenation. For digestion, boil amla with ginger and consume as a decoction. Always consult a doctor for therapeutic doses."
    },
    {
        "Plant Name": "Amruta_Balli",
        "Location": "Amruta Balli (Tinospora cordifolia), also known as Guduchi, is native to India, Myanmar, and Sri Lanka, thriving in tropical and subtropical regions. It grows as a climbing shrub in forests, along roadsides, and in home gardens, preferring loamy, well-drained soils. In India, it’s common in Karnataka, Andhra Pradesh, and Maharashtra, flourishing in warm, humid climates with moderate rainfall. The plant is often cultivated near trees or trellises for support. Its resilience allows it to grow in diverse conditions, from plains to hilly areas, making it a staple in Ayurvedic herb gardens.",
        "Diseases Treated": "Amruta Balli is a powerful immunomodulator, used in Ayurveda to treat fevers, including dengue and malaria, by boosting immunity. It aids diabetes management by lowering blood sugar levels. The plant’s anti-inflammatory properties relieve arthritis and gout. It supports liver health, detoxifying the body and treating jaundice. Amruta Balli is also used for respiratory issues like asthma and chronic cough. Its antioxidant properties promote skin health, treating allergies and infections. In traditional medicine, it’s prescribed for stress relief and to enhance vitality, earning it the name ‘nectar of immortality.’",
        "Preparation Methods": "Amruta Balli stems are used fresh or dried. For fever, boil 2-3 grams of dried stem powder in 200 ml water to make a decoction, taken twice daily. For diabetes, mix 1 teaspoon of stem powder with honey and consume before meals. To boost immunity, chew fresh stems or take 10 ml of stem juice daily. In Ayurveda, the powder is mixed with ghee for arthritis relief. For skin issues, apply a paste of crushed leaves topically. Always use under medical supervision, as overuse may cause low blood sugar."
    },
    {
        "Plant Name": "Arali",
        "Location": "Arali (Nerium oleander) is native to the Mediterranean, Middle East, and parts of Asia, including India. It thrives in warm, subtropical climates, growing along riverbanks, in gardens, and as an ornamental plant. In India, it’s common in Tamil Nadu, Karnataka, and Andhra Pradesh, preferring well-drained soils and sunny locations. The evergreen shrub tolerates drought and poor soils, making it popular in urban landscaping. Its vibrant flowers make it a favorite in temples and parks, though its toxicity requires careful handling. Arali is cultivated widely for both aesthetic and medicinal purposes.",
        "Diseases Treated": "Arali is used in traditional medicine with caution due to its toxicity. It treats skin conditions like eczema, psoriasis, and fungal infections due to its antimicrobial properties. In Ayurveda, it’s applied externally for joint pain and inflammation. The plant’s cardiac glycosides have been studied for heart conditions, though this is rare due to risks. Arali is also used for respiratory issues like asthma in controlled doses. Its antipruritic properties help with itching and skin allergies. Modern research explores its potential anticancer effects, but clinical use is limited due to safety concerns.",
        "Preparation Methods": "Arali is used externally due to its toxicity. For skin conditions, crush fresh leaves and apply the paste to affected areas for 10-15 minutes, then rinse thoroughly. For joint pain, boil leaves in coconut oil and massage the warm oil onto joints. In Ayurveda, a diluted leaf decoction is used as a wash for fungal infections. Never ingest Arali, as it can cause severe poisoning. Always prepare under expert guidance, and avoid contact with eyes or open wounds. Store preparations in labeled containers to prevent accidental misuse."
    },
    {
        "Plant Name": "Ashoka",
        "Location": "Ashoka (Saraca indica) is native to India, Sri Lanka, and Southeast Asia, growing in tropical and subtropical forests. It thrives in moist, well-drained soils, often found in the Western Ghats, Eastern Himalayas, and central India. The tree prefers shaded, humid environments with moderate rainfall, making it common in Kerala and Karnataka. Cultivated in gardens and temple grounds for its vibrant flowers, Ashoka is also grown in Ayurvedic plantations. Its ability to tolerate partial shade makes it suitable for agroforestry. The tree’s cultural significance enhances its presence in Indian landscapes",
        "Diseases Treated": "Ashoka is renowned in Ayurveda for uterine health, treating menstrual disorders, excessive bleeding, and menopausal symptoms. Its analgesic properties relieve dysmenorrhea and joint pain. The bark is used for skin conditions like acne and eczema due to its astringent nature. Ashoka supports heart health, acting as a cardiac tonic. It’s also used for fever and inflammation, with anti-pyretic effects. The plant prevents miscarriages and promotes fertility. Modern studies suggest antibacterial and anticancer properties, making it valuable for infections and tumors. Its rejuvenating effects enhance overall vitality.",
        "Preparation Methods": "Ashoka bark is primarily used. For menstrual issues, boil 5 grams of dried bark powder in 200 ml water to make a decoction, taken twice daily. For skin conditions, apply a paste of bark powder mixed with honey to affected areas. In Ayurveda, Ashoka is combined with ghee for fertility support, taken under supervision. For fever, mix 1 teaspoon of bark powder with warm milk. Soak flowers in water overnight and drink for heart health. Always consult an Ayurvedic practitioner, as improper use may cause side effects. Store preparations in airtight containers."
    },
    {
        "Plant Name": "Ashwagandha",
        "Location": "Ashwagandha (Withania somnifera) is native to India, the Middle East, and North Africa, thriving in dry, subtropical regions. It grows in sandy or rocky soils, commonly found in Rajasthan, Punjab, and Gujarat. The shrub prefers sunny, arid conditions with minimal water, making it resilient in semi-desert areas. Cultivated extensively for its roots, it’s a staple in Ayurvedic farms and home gardens. Ashwagandha is also grown in Madhya Pradesh and Uttar Pradesh, where warm climates support its growth. Its adaptability to poor soils makes it ideal for sustainable agriculture in drought-prone regions.",
        "Diseases Treated": "Ashwagandha is an adaptogen, reducing stress and anxiety by balancing cortisol levels. It enhances memory and slows brain aging, treating conditions like dementia. The root boosts fertility, increasing semen production and sexual health. Ashwagandha supports heart health as a cardiac tonic and aids sleep disorders. It’s used for arthritis, reducing inflammation and joint pain. The plant’s immunomodulatory effects help with infections and chronic fatigue. In Ayurveda, it’s prescribed for rejuvenation, improving vitality and muscle strength. Modern research suggests anticancer and neuroprotective benefits, making it a versatile herb.",
        "Preparation Methods": "Ashwagandha root powder is commonly used. For stress, mix 1-2 grams of powder with warm milk and honey, taken at bedtime. For fertility, consume 1 teaspoon of powder with ghee daily. To boost immunity, boil 3 grams of root in 200 ml water for a decoction, taken twice daily. For arthritis, apply a paste of root powder and sesame oil to joints. In Ayurveda, Ashwagandha is added to chyavanprash for rejuvenation. Avoid overuse, as it may cause drowsiness. Consult a doctor for personalized dosing and storage in cool, dry places."
    },
    {
        "Plant Name": "Avacado",
        "Location": "Avocado (Persea americana) is native to Central and South America but widely cultivated in India, particularly in Kerala, Tamil Nadu, and Karnataka. It thrives in tropical and subtropical climates with well-drained, loamy soils and moderate rainfall. The tree prefers warm temperatures and sunny locations, often grown in hilly regions like the Western Ghats. In India, avocado plantations are expanding due to its nutritional value. It’s also found in Maharashtra and Andhra Pradesh, where fertile soils support its growth. The tree’s need for consistent moisture makes it suitable for areas with reliable irrigation systems.",
        "Diseases Treated": "Avocado is primarily a nutritional plant, but its leaves and seeds have medicinal uses. The leaves treat hypertension and high cholesterol, reducing cardiovascular risks. Avocado oil aids skin conditions like eczema and psoriasis due to its moisturizing properties. The fruit’s antioxidants support eye health, preventing cataracts. In traditional medicine, avocado leaf tea is used for digestion, relieving bloating and constipation. The seeds are ground for antifungal and antibacterial applications, treating skin infections. Avocado’s monounsaturated fats help manage diabetes by improving insulin sensitivity, making it a valuable dietary addition for overall health.",
        "Preparation Methods": "Avocado leaves are boiled to make tea for hypertension; steep 2-3 leaves in 200 ml hot water for 10 minutes, drink daily. For skin issues, apply avocado oil directly or mix with honey for a mask, left on for 15 minutes. Ground seed powder is mixed with water to form a paste for fungal infections, applied twice daily. The fruit is eaten raw or blended into smoothies for heart health. In Ayurveda, avocado is combined with spices for digestion. Store oil in dark bottles and use fresh leaves for maximum potency."
    },
    {
        "Plant Name": "Bamboo",
        "Location": "Bamboo (various species, e.g., Bambusa vulgaris) is native to Asia, including India, China, and Southeast Asia, thriving in tropical and subtropical regions. In India, it’s widespread in Assam, Arunachal Pradesh, and Karnataka, growing in forests, riverbanks, and cultivated groves. Bamboo prefers moist, well-drained soils and humid climates, often found in monsoon-prone areas. It’s cultivated for construction, food, and medicine, with species like Bambusa arundinacea used medicinally. The fast-growing grass adapts to diverse altitudes, from plains to hills, making it a versatile crop in rural and urban landscapes.",
        "Diseases Treated": "Bamboo shoots and leaves have medicinal uses in Ayurveda and traditional Chinese medicine. They treat respiratory issues like asthma and bronchitis due to anti-inflammatory properties. Bamboo leaf tea aids digestion, relieving bloating and constipation. The silica content strengthens bones and hair, helping with osteoporosis and hair loss. Bamboo is used for skin conditions, with leaf extracts treating wounds and infections. Its diuretic properties support kidney health, reducing urinary infections. In tribal medicine, bamboo is used for fever and inflammation, and modern research explores its antioxidant and antimicrobial potential.",
        "Preparation Methods": "Bamboo shoots are boiled or fermented for edible use. For respiratory issues, boil 5 grams of dried leaves in 200 ml water for a decoction, taken twice daily. For skin wounds, apply a paste of fresh leaf extract mixed with turmeric, left on for 20 minutes. To strengthen hair, massage bamboo silica oil into the scalp weekly. In Ayurveda, bamboo shoot juice is mixed with honey for digestion, taken daily. Store dried leaves in airtight containers. Consult a practitioner, as excessive use may cause digestive discomfort."
    },
    {
        "Plant Name": "Basale",
        "Location": "Basale (Basella alba), also known as Malabar spinach, is native to India and Southeast Asia, thriving in tropical and subtropical climates. It grows as a climbing vine in Karnataka, Kerala, and Tamil Nadu, preferring moist, fertile soils and warm, humid conditions. Basale is common in home gardens and farms, often trained on trellises. It tolerates partial shade and heavy rainfall, making it ideal for monsoon regions. The plant’s adaptability to various soils and climates supports its widespread cultivation in rural and urban areas, especially in South India.",
        "Diseases Treated": "Basale is used in Ayurveda for its cooling and nutritive properties. The leaves treat constipation and digestive disorders, promoting bowel regularity. Its mucilaginous nature soothes ulcers and sore throats. Basale’s antioxidants help with skin health, reducing acne and inflammation. The plant is used for anemia due to its iron and folate content, boosting blood production. In traditional medicine, it treats urinary infections and kidney issues as a diuretic. Basale leaf juice is applied for burns and wounds, aiding healing. It’s also used to reduce fever and boost immunity.",
        "Preparation Methods": "Basale leaves are cooked or used raw. For digestion, boil 10 leaves in 200 ml water to make a decoction, taken twice daily. For skin issues, apply a paste of crushed leaves to acne or burns for 15 minutes. To treat anemia, consume cooked leaves daily or drink 10 ml of leaf juice. In Ayurveda, basale is stir-fried with ghee for ulcers. For sore throats, gargle with leaf juice mixed with salt. Store fresh leaves in a refrigerator for up to a week. Consult a doctor for therapeutic use to avoid overuse."
    },
    {
        "Plant Name": "Betel",
        "Location": "Betel (Piper betle) is native to Southeast Asia, including India, Indonesia, and Malaysia, thriving in tropical, humid climates. In India, it’s cultivated in Assam, West Bengal, and Tamil Nadu, growing as a climbing vine on poles or trees. Betel prefers shaded, moist environments with rich, loamy soils and heavy rainfall. It’s a common sight in rural gardens and commercial plantations, often grown alongside areca nut. The plant’s cultural significance in rituals and chewing practices ensures its widespread cultivation, particularly in eastern and southern India.",
        "Diseases Treated": "Betel leaves are used in Ayurveda for their antimicrobial and analgesic properties. They treat respiratory issues like cough and bronchitis, relieving chest congestion. Betel aids digestion, reducing bloating and acidity. The leaves are applied topically for wounds, burns, and skin infections due to their antiseptic nature. Betel is used for oral health, reducing bad breath and gum infections when chewed. It’s also employed for headaches and joint pain, with leaves applied as a poultice. In traditional medicine, betel treats fever and boosts immunity, though excessive use may irritate mucous membranes.",
        "Preparation Methods": "Betel leaves are used fresh. For cough, boil 2-3 leaves in 200 ml water for a decoction, taken twice daily. For wounds, apply a paste of crushed leaves for 15 minutes. To aid digestion, chew 1-2 leaves after meals or drink leaf juice (5 ml) with honey. For oral health, wrap a leaf around cloves and chew. In Ayurveda, betel is mixed with lime paste for topical pain relief. Store leaves in a damp cloth to maintain freshness. Avoid overuse, as it may cause oral irritation. Consult a practitioner for safe use."
    },
    {
        "Plant Name": "Betel_Nut",
        "Location": "Betel Nut (Areca catechu) is native to Southeast Asia, including India, Indonesia, and the Philippines, thriving in tropical climates. In India, it’s cultivated in Assam, Karnataka, and Kerala, growing as a tall palm in humid, coastal regions. The tree prefers well-drained, loamy soils and heavy rainfall, often found in plantations alongside betel vines. It’s common in eastern and southern India, where chewing betel quid is a cultural practice. Betel nut’s economic importance drives its cultivation in rural and urban areas, though its health risks are increasingly recognized.",
        "Diseases Treated": "Betel nut is used sparingly in traditional medicine due to its stimulant and carcinogenic properties. It treats digestive issues like bloating and worms, acting as a purgative. In Ayurveda, it’s used for oral health, strengthening gums when chewed in small amounts. Betel nut is applied externally for skin infections and wounds due to its astringent nature. It’s also used for respiratory issues like asthma in controlled doses. However, its use is limited due to risks of oral cancer and addiction. Modern medicine advises caution, favoring safer alternatives for most conditions.",
        "Preparation Methods": "Betel nut is used fresh or dried, but sparingly. For digestion, chew a small piece (1-2 grams) with betel leaf after meals. For worms, take 1 gram of dried nut powder with water, under supervision. For skin infections, apply a paste of ground nut mixed with turmeric for 10 minutes. In Ayurveda, betel nut is boiled with herbs for a mouth rinse to strengthen gums. Never consume large amounts, as it’s toxic. Store nuts in airtight containers. Consult a doctor, as prolonged use is linked to serious health risks."
    },
    {
        "Plant Name": "Brahmi",
        "Location": "Brahmi (Bacopa monnieri) is native to wetlands of India, Australia, and Southeast Asia, thriving in marshy areas and along riverbanks. In India, it’s widespread in Uttar Pradesh, Tamil Nadu, and West Bengal, growing in muddy, waterlogged soils. The creeping herb prefers warm, humid climates with ample moisture, often found in rice fields or cultivated in pots. Brahmi tolerates partial shade and is grown hydroponically for medicinal use. Its prominence in Ayurveda for cognitive health ensures its cultivation in herbal gardens across India, making it accessible in both wild and controlled environments.",
        "Diseases Treated": "Brahmi is a cornerstone in Ayurveda for enhancing memory, treating dementia, and improving cognitive function. It reduces anxiety and stress as an adaptogen, aiding insomnia and epilepsy. The herb’s neuroprotective properties support mental clarity and may slow brain aging. Brahmi treats skin conditions like eczema and promotes hair health, preventing hair loss. Its antioxidants boost immunity and combat infections. In traditional medicine, it’s used for respiratory issues like asthma and digestive health. Modern studies confirm its benefits for verbal learning and anxiety reduction, though gastrointestinal side effects may occur.",
        "Preparation Methods": "Brahmi leaves and stems are used fresh or dried. For memory enhancement, mix 1 teaspoon of dried leaf powder with milk, taken daily. For stress, drink 10 ml of leaf juice with honey twice daily. To treat skin issues, apply a paste of fresh leaves for 15 minutes. In Ayurveda, Brahmi is boiled with ghee for epilepsy, taken under supervision. For hair health, massage Brahmi oil into the scalp weekly. Store powder in airtight containers and use fresh leaves within a week. Consult a practitioner, as high doses may cause nausea."
    },
    {
        "Plant Name": "Castor",
        "Location": "Castor (Ricinus communis) is native to Africa and India, thriving in tropical and subtropical regions. In India, it’s cultivated in Gujarat, Andhra Pradesh, and Rajasthan, growing in wastelands and along roadsides. The shrub prefers well-drained, loamy soils and warm, sunny climates with moderate rainfall. Castor is grown commercially for its oil, with large plantations in western India. Its adaptability to poor soils and drought tolerance make it a resilient crop. In rural areas, it’s planted as a hedge or for medicinal use, though its seeds are toxic and require careful handling.",
        "Diseases Treated": "Castor oil is a potent laxative, treating constipation and intestinal worms. It’s used externally for arthritis, reducing joint inflammation and pain. The oil treats skin conditions like eczema and fungal infections due to its antimicrobial properties. In Ayurveda, castor is used for hair growth, preventing hair loss. It’s applied for wounds and burns, promoting healing. Castor oil is also used to induce labor in traditional medicine, though this requires medical supervision. Its anti-inflammatory properties help with hemorrhoids. Modern research explores its potential in immunotherapy and wound healing.",
        "Preparation Methods": "Castor oil is extracted from seeds. For constipation, take 1-2 teaspoons of oil with warm water at bedtime, under supervision. For arthritis, massage warm castor oil into joints daily. To treat skin issues, apply oil directly or mix with coconut oil, left on for 20 minutes. For hair, massage oil into the scalp weekly, rinsing after an hour. In Ayurveda, castor leaves are warmed and applied to painful areas. Store oil in dark bottles. Avoid internal use in pregnancy or without medical advice due to toxicity risks."
    },
    {
        "Plant Name": "Curry_Leaf",
        "Location": "Curry Leaf (Murraya koenigii) is native to India and Sri Lanka, thriving in tropical and subtropical climates. It’s widely grown in Tamil Nadu, Karnataka, and Andhra Pradesh, found in home gardens and farms. The small tree prefers well-drained, fertile soils and sunny or partially shaded areas, tolerating moderate rainfall. Curry leaf is cultivated for culinary and medicinal use, a common backyard plant in South India. Its aromatic leaves are a dietary staple, and its ornamental value adds to its popularity in urban gardens across India.",
        "Diseases Treated": "Curry leaves are used in Ayurveda for digestive health, treating diarrhea, dysentery, and bloating. They aid diabetes management by lowering blood sugar levels. The leaves’ antioxidants promote hair health, preventing premature graying and hair loss. Curry leaf is used for skin conditions like acne and burns, with antimicrobial properties. It supports liver health, detoxifying the body and preventing jaundice. The plant’s anti-inflammatory effects help with arthritis and wounds. In traditional medicine, curry leaves boost immunity and treat morning sickness. Modern research suggests cholesterol-lowering and anticancer potential.",
        "Preparation Methods": "Curry leaves are used fresh or dried. For digestion, chew 5-6 fresh leaves daily or boil 10 leaves in 200 ml water for a decoction, taken twice daily. For hair, boil leaves in coconut oil and massage into the scalp weekly. To treat skin issues, apply a paste of crushed leaves for 15 minutes. In Ayurveda, leaf powder is mixed with honey for diabetes, taken daily. For liver health, drink leaf juice (10 ml) with buttermilk. Store fresh leaves in a refrigerator. Consult a doctor for therapeutic doses."
    },
    {
        "Plant Name": "Doddapatre",
        "Location": "Doddapatre (Coleus amboinicus), also known as Indian borage, is native to East Africa but widely cultivated in India, especially in Karnataka, Tamil Nadu, and Maharashtra. It thrives in tropical and subtropical climates, growing in well-drained, loamy soils with partial shade. The succulent herb is common in home gardens and pots, preferring warm, humid conditions with moderate rainfall. Doddapatre is grown for culinary and medicinal use, often found in South Indian households. Its aromatic leaves and low maintenance make it popular in herbal gardens.",
        "Diseases Treated": "Doddapatre is used in Ayurveda for respiratory issues like cough, asthma, and bronchitis, clearing congestion with its expectorant properties. It treats digestive disorders, relieving acidity and irritable bowel syndrome. The leaves’ antimicrobial properties help with skin infections, wounds, and insect bites. Doddapatre is used for fever and headaches, with cooling effects. In traditional medicine, it treats urinary infections and kidney stones as a diuretic. The herb boosts immunity and soothes sore throats. Its anti-inflammatory compounds reduce redness and swelling. Modern research explores its antimicrobial potential.",
        "Preparation Methods": "Doddapatre leaves are used fresh. For cough, chew 2-3 leaves or drink a decoction (boil 5 leaves in 200 ml water with 1 tsp pepper), taken twice daily. For skin infections, apply a paste of crushed leaves for 15 minutes. To relieve headaches, rub leaf juice on the forehead. In Ayurveda, leaves are fried in ghee for digestion, eaten daily. For urinary issues, drink 10 ml of leaf juice with honey. Store fresh leaves in a refrigerator for up to a week. Consult a practitioner, as excessive use may cause stomach upset."
    },
    {
        "Plant Name": "Ekka",
        "Location": "Ekka (Calotropis gigantea), also known as crown flower, is native to India, Southeast Asia, and China, thriving in arid and semi-arid regions. It grows in wastelands, along roadsides, and in dry forests of Rajasthan, Gujarat, and Tamil Nadu. The shrub prefers sandy, well-drained soils and sunny, dry climates, tolerating extreme heat and drought. Ekka is often found in rural areas and is cultivated for medicinal and ritual use. Its resilience to harsh conditions makes it common in desert landscapes, though its latex is toxic.",
        "Diseases Treated": "Ekka is used in Ayurveda with caution due to its toxicity. It treats skin conditions like eczema, ringworm, and boils, with its latex applied topically for antimicrobial effects. The leaves relieve joint pain and arthritis when used as a poultice. Ekka is used for respiratory issues like asthma and cough, reducing inflammation. In traditional medicine, it treats snake bites and scorpion stings, though this requires expert supervision. The plant’s root is used for fever and digestive issues. Modern research explores its anticancer and wound-healing properties, but clinical use is limited.",
        "Preparation Methods": "Ekka leaves and latex are used externally. For skin issues, apply diluted latex (mixed with water) to affected areas for 10 minutes, then rinse. For arthritis, warm leaves, apply as a poultice, and leave for 20 minutes. In Ayurveda, root powder (0.5 grams) is mixed with honey for fever, taken under supervision. For respiratory issues, inhale steam from boiled leaves. Never ingest Ekka, as it’s highly toxic. Store dried parts in labeled containers to prevent misuse. Consult an Ayurvedic expert, as improper handling can cause severe irritation or poisoning."
    },
    {
        "Plant Name": "Ganike",
        "Location": "Ganike (Solanum nigrum), also known as black nightshade, is native to Eurasia and widely naturalized in India, growing in Karnataka, Andhra Pradesh, and Uttar Pradesh. It thrives in temperate and subtropical climates, found in wastelands, fields, and gardens. The herb prefers fertile, well-drained soils and sunny or partially shaded areas, tolerating moderate rainfall. Ganike is often considered a weed in agricultural fields but is also cultivated for medicinal use. Its adaptability to various soils and climates makes it common in rural and urban areas of India.",
        "Diseases Treated": "Ganike is used in Ayurveda for liver health, treating jaundice and hepatitis due to its hepatoprotective properties. It aids digestion, relieving constipation and bloating. The ripe berries and leaves treat skin conditions like eczema and psoriasis, with antimicrobial effects. Ganike is used for fever and inflammation, acting as an anti-pyretic. In traditional medicine, it supports eye health, improving vision, and treats oral ulcers. The plant’s antioxidants boost immunity and may have anticancer potential. However, unripe berries are toxic, so only ripe ones are used medicinally.",
        "Preparation Methods": "Ganike ripe berries and leaves are used. For liver health, boil 5 grams of dried leaves in 200 ml water for a decoction, taken twice daily. For skin issues, apply a paste of ripe berries for 15 minutes. To reduce fever, drink leaf juice (10 ml) with honey. In Ayurveda, cooked leaves are eaten for digestion. For oral ulcers, chew fresh leaves daily. Store dried leaves in airtight containers. Consult a doctor, as unripe berries or excessive use can cause toxicity. Use only under expert guidance."
    },
    {
        "Plant Name": "Gauva",
        "Location": "Guava (Psidium guajava) is native to Central and South America but widely cultivated in India, particularly in Uttar Pradesh, Maharashtra, and Tamil Nadu. It thrives in tropical and subtropical climates, growing in well-drained, loamy soils with moderate rainfall. The tree prefers sunny locations and is common in orchards, home gardens, and farms. Guava is grown commercially for its fruit, with major production in northern and southern India. Its tolerance for various soils and climates makes it a popular crop in rural and urban areas, especially in warm regions.",
        "Diseases Treated": "Guava leaves and fruit are used medicinally. The leaves treat diarrhea and dysentery due to their astringent properties. Guava aids diabetes management by lowering blood sugar levels. The fruit’s high vitamin C content boosts immunity and treats scurvy. Guava leaves are used for oral health, reducing gum inflammation and bad breath. The plant’s antioxidants support skin health, treating acne and wounds. In Ayurveda, guava is used for digestive health and respiratory issues like cough. Modern research suggests cholesterol-lowering and anticancer potential, making it a versatile medicinal plant.",
        "Preparation Methods": "Guava leaves are boiled for tea to treat diarrhea; steep 5-6 leaves in 200 ml hot water, drink twice daily. For diabetes, chew 2-3 fresh leaves daily or drink leaf juice (10 ml). For oral health, chew leaves or use a leaf decoction as a mouthwash. In Ayurveda, guava fruit is eaten raw for immunity. For skin issues, apply a paste of crushed leaves for 15 minutes. Store fresh leaves in a refrigerator. Consult a doctor for therapeutic use, as excessive leaf consumption may lower blood pressure."
    },
    {
        "Plant Name": "Geranium",
        "Location": "Geranium (Pelargonium graveolens) is native to South Africa but cultivated in India, particularly in Tamil Nadu, Karnataka, and Himachal Pradesh. It thrives in temperate and subtropical climates, growing in well-drained, loamy soils with moderate rainfall. The herb prefers sunny or partially shaded areas and is common in gardens and essential oil plantations. Geranium is grown for its aromatic leaves, used in perfumery and medicine. Its ornamental value makes it popular in urban landscapes. In India, it’s cultivated in hilly regions for optimal oil yield.",
        "Diseases Treated": "Geranium essential oil and leaves are used in Ayurveda and aromatherapy. The oil treats anxiety and stress, promoting relaxation. It’s used for skin conditions like acne, eczema, and fungal infections due to its antimicrobial properties. Geranium aids wound healing and reduces inflammation, helping with bruises and hemorrhoids. The leaves treat respiratory issues like sore throats and sinusitis. In traditional medicine, geranium is used for menstrual cramps and digestive issues. Modern research suggests its potential for balancing hormones and improving skin health, making it valuable in natural cosmetics.",
        "Preparation Methods": "Geranium leaves are distilled for essential oil. For stress, add 2-3 drops of oil to a diffuser or mix with carrier oil for a massage. For skin issues, apply diluted oil (1 drop per teaspoon of coconut oil) to affected areas. For wounds, use a leaf poultice for 15 minutes. In Ayurveda, leaf tea (steep 5 leaves in 200 ml water) is drunk for digestion, taken daily. For respiratory issues, inhale steam with 1 drop of oil. Store oil in dark bottles. Consult a practitioner, as undiluted oil may irritate skin."
    },
    {
        "Plant Name": "Henna",
        "Location": "Henna (Lawsonia inermis) is native to North Africa, the Middle East, and India, thriving in arid and semi-arid regions. In India, it’s cultivated in Rajasthan, Gujarat, and Punjab, growing in sandy, well-drained soils with hot, dry climates. The shrub prefers sunny locations and is common in farms and gardens. Henna is grown commercially for its leaves, used in dyes and medicine. Its drought tolerance makes it ideal for desert areas. In rural India, henna is planted as a hedge and for cultural practices like mehndi application.",
        "Diseases Treated": "Henna leaves are used in Ayurveda for skin and hair health. They treat fungal infections, eczema, and burns due to antimicrobial and cooling properties. Henna is used for hair dyeing and conditioning, preventing dandruff and hair loss. The leaves relieve headaches and fever when applied as a paste. Henna is used for liver health, treating jaundice, and for wound healing. In traditional medicine, it’s applied for foot infections and nail health. Modern research suggests its potential for anti-inflammatory and anticancer effects, though clinical use is limited.",
        "Preparation Methods": "Henna leaves are dried and powdered. For hair, mix 50 grams of powder with water to form a paste, apply to hair for 2-3 hours, then rinse. For skin infections, apply a leaf paste for 15 minutes. To relieve headaches, apply a forehead paste of crushed leaves. In Ayurveda, henna tea (steep 5 grams of powder in 200 ml water) is drunk for liver health, taken daily. For burns, mix powder with coconut oil and apply. Store powder in airtight containers. Consult a doctor, as overuse may cause skin irritation."
    },
    {
        "Plant Name": "Hibiscus",
        "Location": "Hibiscus (Hibiscus rosa-sinensis) is native to Asia, including India, and thrives in tropical and subtropical climates. It’s widely cultivated in Tamil Nadu, Kerala, and West Bengal, growing in well-drained, fertile soils with heavy rainfall. The shrub prefers sunny locations and is common in gardens, temples, and urban landscapes. Hibiscus is grown for its vibrant flowers, used in medicine and rituals. Its tolerance for humid climates makes it a staple in South Indian households. The plant’s ornamental value and medicinal uses ensure its widespread cultivation across India in both rural and urban settings.",
        "Diseases Treated": "Hibiscus flowers and leaves are used in Ayurveda for hair and skin health, preventing hair loss and dandruff. They treat hypertension by lowering blood pressure, supporting heart health. The flowers aid menstrual disorders, reducing cramps and regulating cycles. Hibiscus’s antioxidants boost immunity and combat infections. It’s used for respiratory issues like cough and for digestive health, relieving constipation. In traditional medicine, hibiscus treats skin conditions like acne and eczema. Modern research suggests cholesterol-lowering and anti-diabetic effects, making it valuable for holistic wellness and cardiovascular health.",
        "Preparation Methods": "Hibiscus flowers are used fresh or dried. For hair, boil 5 flowers in coconut oil and massage into the scalp weekly, rinsing after an hour. For hypertension, drink tea (steep 5 dried flowers in 200 ml hot water) daily. For menstrual issues, consume a decoction of 5 grams of leaf powder in 200 ml water, taken twice daily. In Ayurveda, flower paste is applied for skin issues for 15 minutes. For digestion, chew fresh petals. Store dried flowers in airtight containers. Consult a doctor, as excessive use may lower blood pressure excessively."
    },
    {
        "Plant Name": "Honge",
        "Location": "Honge (Pongamia pinnata), also known as Indian beech, is native to India, Southeast Asia, and Australia, thriving in tropical and subtropical climates. It grows in Karnataka, Andhra Pradesh, and Tamil Nadu, found along roadsides, riverbanks, and in forests. The tree prefers well-drained, sandy soils and sunny locations, tolerating drought and salinity. Honge is cultivated for its oil, used in medicine and biofuels. Its shade-giving canopy makes it popular in agroforestry and urban areas. In rural India, it’s planted for erosion control and medicinal use.",
        "Diseases Treated": "Honge seeds and leaves are used in Ayurveda for skin and joint health. The oil treats eczema, psoriasis, and fungal infections due to its antimicrobial properties. Honge is used for arthritis, reducing inflammation and pain when applied topically. The leaves aid wound healing and treat skin ulcers. In traditional medicine, honge oil is used for diabetes management, lowering blood sugar. The plant’s anti-inflammatory properties help with respiratory issues like asthma. Modern research explores its antimicrobial and anti-diabetic potential, though clinical use is limited. Its oil also repels insects.",
        "Preparation Methods": "Honge seeds are pressed for oil. For skin issues, apply honge oil directly or mix with coconut oil, left on for 20 minutes. For arthritis, massage warm oil into joints daily. To treat wounds, apply a leaf paste for 15 minutes. In Ayurveda, 1-2 drops of oil are taken with honey for diabetes, under supervision. For respiratory issues, inhale steam with crushed leaves. Store oil in dark bottles and use fresh leaves within a week. Consult a doctor, as internal use may cause digestive upset. Always use under medical guidance."
    },
    {
        "Plant Name": "Insulin",
        "Location": "Insulin plant (Costus igneus) is native to South America but widely cultivated in India, particularly in Kerala, Tamil Nadu, and Karnataka. It thrives in tropical climates, growing in well-drained, loamy soils with partial shade. The herb prefers humid, warm conditions and is common in home gardens and Ayurvedic plantations. Insulin plant is grown for its medicinal leaves, used for diabetes management. Its low maintenance and ornamental value make it popular in urban and rural areas. In India, it’s often potted or planted in shaded garden corners for easy access.",
        "Diseases Treated": "Insulin plant is primarily used in Ayurveda for diabetes, lowering blood sugar levels by enhancing insulin sensitivity. The leaves treat hyperglycemia and support pancreatic health. It’s used for urinary issues, acting as a diuretic to reduce kidney stones. The plant’s antioxidants boost immunity and promote skin health, treating infections. In traditional medicine, insulin plant is used for respiratory issues like asthma and for digestive health, relieving bloating. Modern research supports its anti-diabetic effects, though clinical evidence is limited. It’s a popular home remedy for metabolic disorders.",
        "Preparation Methods": "Insulin plant leaves are used fresh. For diabetes, chew 1-2 leaves daily or drink a decoction (boil 2 leaves in 200 ml water), taken twice daily. For urinary issues, consume 10 ml of leaf juice with honey. To boost immunity, eat leaves raw or add to salads. In Ayurveda, leaf powder is mixed with water for digestion, taken daily. For skin infections, apply a leaf paste for 15 minutes. Store fresh leaves in a refrigerator. Consult a doctor, as excessive use may cause hypoglycemia in diabetics."
    },
    {
        "Plant Name": "Jasmine",
        "Location": "Jasmine (Jasminum grandiflorum) is native to South Asia, including India, and thrives in tropical and subtropical climates. It’s cultivated in Tamil Nadu, Karnataka, and Uttar Pradesh, growing in well-drained, loamy soils with moderate rainfall. The climbing shrub prefers sunny or partially shaded areas and is common in gardens, temples, and perfume plantations. Jasmine is grown for its fragrant flowers, used in medicine and cosmetics. Its cultural significance in rituals and garlands ensures its widespread cultivation. In India, it’s a staple in both rural and urban landscapes.",
        "Diseases Treated": "Jasmine flowers and leaves are used in Ayurveda for skin and mental health. They treat anxiety and depression, promoting relaxation with their aroma. Jasmine oil aids skin conditions like eczema and acne, with antimicrobial properties. The flowers are used for eye health, reducing conjunctivitis. In traditional medicine, jasmine treats menstrual cramps and digestive issues. The plant’s antioxidants boost immunity and support wound healing. Modern research suggests its potential for anti-inflammatory and sedative effects, making it valuable in aromatherapy and natural cosmetics. It’s also used for oral health.",
        "Preparation Methods": "Jasmine flowers are distilled for oil or used fresh. For anxiety, add 2-3 drops of jasmine oil to a diffuser or inhale directly. For skin issues, apply diluted oil (1 drop per teaspoon of carrier oil) for 15 minutes. For eye health, soak flowers in water overnight and use as an eye wash. In Ayurveda, flower tea (steep 5 flowers in 200 ml water) is drunk for digestion, taken daily. For oral health, chew fresh petals. Store oil in dark bottles. Consult a practitioner, as undiluted oil may irritate skin."
    },
    {
        "Plant Name": "Lemon",
        "Location": "Lemon (Citrus limon) is native to South Asia, including India, and thrives in tropical and subtropical climates. It’s cultivated in Andhra Pradesh, Maharashtra, and Gujarat, growing in well-drained, loamy soils with moderate rainfall. The tree prefers sunny locations and is common in orchards, home gardens, and farms. Lemon is grown commercially for its fruit, used in culinary and medicinal applications. Its tolerance for warm climates makes it a staple in Indian agriculture. In rural and urban areas, lemon trees are planted for their fruit and ornamental value.",
        "Diseases Treated": "Lemon fruit and peel are used in Ayurveda for digestive and immune health. The juice treats scurvy and boosts immunity due to high vitamin C content. Lemon aids digestion, relieving acidity and bloating. It’s used for skin health, treating acne and dark spots with its astringent properties. Lemon juice supports weight loss by boosting metabolism. In traditional medicine, it treats respiratory issues like cough and sore throats. The peel’s antioxidants reduce cholesterol and support heart health. Modern research suggests its potential for anticancer and antimicrobial effects, enhancing its medicinal value.",
        "Preparation Methods": "Lemon juice is used fresh. For immunity, drink 20 ml of juice mixed with warm water and honey daily. For digestion, consume lemon water (half a lemon in 200 ml water) before meals. For skin, apply diluted juice to acne for 10 minutes. In Ayurveda, lemon peel is dried and powdered, mixed with honey for cholesterol, taken daily. For sore throats, gargle with lemon juice and salt. Store lemons in a refrigerator. Consult a doctor, as excessive use may erode tooth enamel or cause acidity."
    },
    {
        "Plant Name": "Lemon_grass",
        "Location": "Lemongrass (Cymbopogon citratus) is native to Southeast Asia and widely cultivated in India, particularly in Kerala, Tamil Nadu, and Assam. It thrives in tropical climates, growing in well-drained, loamy soils with heavy rainfall. The grass prefers sunny locations and is common in gardens, farms, and essential oil plantations. Lemongrass is grown for its aromatic stalks, used in culinary and medicinal applications. Its tolerance for humid conditions makes it a staple in South Indian agriculture. In rural and urban areas, it’s planted for its fragrance and low maintenance.",
        "Diseases Treated": "Lemongrass is used in Ayurveda for digestive and immune health. It treats bloating, indigestion, and irritable bowel syndrome due to its carminative properties. The essential oil reduces anxiety and promotes sleep. Lemongrass aids cholesterol management, lowering LDL levels. It’s used for respiratory issues like cough and flu, with antimicrobial effects. The plant’s antioxidants boost immunity and treat skin infections. In traditional medicine, lemongrass relieves muscle pain and fever. Modern research suggests its potential for anti-diabetic and anticancer effects, making it valuable for holistic wellness.",
        "Preparation Methods": "Lemongrass stalks are used fresh or dried. For digestion, boil 2-3 stalks in 200 ml water for a tea, drunk twice daily. For anxiety, add 2 drops of lemongrass oil to a diffuser. For skin infections, apply diluted oil (1 drop per teaspoon of carrier oil) for 15 minutes. In Ayurveda, stalk juice (10 ml) is mixed with honey for fever, taken daily. For muscle pain, massage with lemongrass oil. Store stalks in a refrigerator. Consult a doctor, as excessive oil use may cause skin irritation."
    },
    {
        "Plant Name": "Mango",
        "Location": "Mango (Mangifera indica) is native to South Asia, including India, and thrives in tropical and subtropical climates. It’s cultivated in Uttar Pradesh, Andhra Pradesh, and Maharashtra, growing in well-drained, loamy soils with moderate rainfall. The tree prefers sunny locations and is common in orchards, farms, and home gardens. Mango is grown commercially for its fruit, with India being a global leader. Its tolerance for warm climates makes it a staple in Indian agriculture. In rural and urban areas, mango trees are planted for fruit, shade, and medicinal use.",
        "Diseases Treated": "Mango leaves and fruit are used in Ayurveda for digestive and immune health. The leaves treat diabetes, lowering blood sugar levels through their hypoglycemic effects. The fruit’s vitamins boost immunity and treat scurvy due to high vitamin C content. Mango aids digestion, relieving constipation and acidity. The leaves are used for oral health, reducing gum inflammation. In traditional medicine, mango treats respiratory issues like asthma and skin conditions like burns. The plant’s antioxidants support heart health and may have anticancer potential, making it a versatile medicinal plant.",
        "Preparation Methods": "Mango leaves are boiled for tea to treat diabetes; steep 5-6 leaves in 200 ml hot water, drink twice daily. For digestion, eat ripe mango fruit or drink its juice (20 ml) daily. For oral health, chew fresh leaves or use a leaf decoction as a mouthwash. In Ayurveda, dried leaf powder is mixed with honey for asthma, taken daily. For skin burns, apply a leaf paste for 15 minutes. Store fresh leaves in a refrigerator. Consult a doctor, as excessive leaf consumption may affect blood sugar levels."
    },
    {
        "Plant Name": "Mint",
        "Location": "Mint (Mentha species, e.g., Mentha spicata) is native to Europe and Asia, widely cultivated in India, particularly in Uttar Pradesh, Punjab, and Tamil Nadu. It thrives in temperate and subtropical climates, growing in moist, well-drained soils with partial shade. The herb prefers cool, humid conditions and is common in home gardens, farms, and culinary plantations. Mint is grown for its aromatic leaves, used in food and medicine. Its fast-growing nature makes it a popular choice in urban and rural areas, often potted for easy access.",
        "Diseases Treated": "Mint is used in Ayurveda for digestive and respiratory health. It treats indigestion, bloating, and irritable bowel syndrome with its carminative properties. Mint relieves respiratory issues like cough, asthma, and sinusitis due to its decongestant effects. The leaves aid oral health, reducing bad breath and gum infections. Mint is used for skin conditions like acne and insect bites, with cooling and antimicrobial properties. In traditional medicine, it treats headaches and fever. Modern research suggests its potential for antimicrobial and antioxidant effects, making it valuable for overall wellness and immune support.",
        "Preparation Methods": "Mint leaves are used fresh or dried. For digestion, drink mint tea (steep 10 leaves in 200 ml hot water) twice daily. For respiratory issues, inhale steam with 5 crushed leaves. For skin issues, apply a paste of fresh leaves for 15 minutes. In Ayurveda, mint juice (10 ml) is mixed with honey for fever, taken daily. For oral health, chew fresh leaves or use as a mouthwash. Store leaves in a refrigerator for up to a week. Consult a doctor, as excessive use may cause heartburn in some individuals."
    },
    {
        "Plant Name": "Nagadali",
        "Location": "Nagadali (Tridax procumbens), also known as coatbuttons, is native to Central and South America but widely naturalized in India, thriving in tropical and subtropical regions. It grows in Karnataka, Maharashtra, and Tamil Nadu, found in wastelands, roadsides, and gardens. The herb prefers well-drained, sandy soils and sunny locations, tolerating drought and poor soils. Nagadali is often considered a weed but is cultivated for medicinal use in Ayurveda. Its adaptability to diverse climates makes it common in rural and urban areas, especially in disturbed soils.",
        "Diseases Treated": "Nagadali is used in Ayurveda for wound healing, with its leaves promoting clotting and tissue repair. It treats skin conditions like eczema and fungal infections due to antimicrobial properties. The herb is used for digestive issues, relieving diarrhea and bloating. Nagadali aids liver health, treating jaundice, and has anti-inflammatory effects for joint pain. In traditional medicine, it’s used for hair growth and to reduce fever. Modern research suggests its potential for antioxidant, antidiabetic, and anticancer effects, though clinical use is limited. The plant boosts immunity and supports overall vitality.",
        "Preparation Methods": "Nagadali leaves are used fresh. For wounds, apply a paste of crushed leaves for 15 minutes to promote healing. For skin issues, mix leaf juice with turmeric and apply for 10 minutes. For digestion, drink a decoction (boil 5 grams of leaves in 200 ml water) twice daily. In Ayurveda, leaf juice (10 ml) is taken with honey for liver health. For hair, massage leaf extract into the scalp weekly. Store fresh leaves in a refrigerator. Consult a doctor, as excessive use may cause digestive discomfort or allergic reactions."
    },
    {
        "Plant Name": "Neem",
        "Location": "Neem (Azadirachta indica) is native to India and Southeast Asia, thriving in tropical and subtropical climates. It’s widely cultivated in Uttar Pradesh, Tamil Nadu, and Gujarat, growing in well-drained, sandy soils with moderate rainfall. The tree prefers sunny locations and is common in forests, villages, and urban areas. Neem is grown for its medicinal leaves, seeds, and oil, with large plantations in northern and southern India. Its drought tolerance and insect-repellent properties make it a staple in agroforestry and home gardens across India.",
        "Diseases Treated": "Neem is a powerhouse in Ayurveda, treating skin conditions like acne, eczema, and psoriasis with its antimicrobial and anti-inflammatory properties. It boosts immunity, fighting infections and fevers. Neem aids oral health, reducing plaque and gum infections. The leaves and oil treat diabetes by lowering blood sugar. Neem is used for digestive health, relieving worms and ulcers. In traditional medicine, it repels insects and treats wounds. Modern research supports its anticancer, antifungal, and antiviral potential, making it valuable for holistic health and as a natural pesticide.",
        "Preparation Methods": "Neem leaves, seeds, and oil are used. For skin issues, apply a paste of fresh leaves or neem oil for 15 minutes. For immunity, drink a decoction (boil 5 leaves in 200 ml water) daily. For oral health, chew fresh leaves or use neem twig as a toothbrush. In Ayurveda, 1-2 drops of neem oil are taken with honey for diabetes, under supervision. For wounds, apply diluted oil. Store oil in dark bottles and leaves in a refrigerator. Consult a doctor, as excessive use may cause liver issues."
    },
    {
        "Plant Name": "Nithyapushpa",
        "Location": "Nithyapushpa (Catharanthus roseus), also known as Madagascar periwinkle, is native to Madagascar but widely cultivated in India, particularly in Tamil Nadu, Karnataka, and Andhra Pradesh. It thrives in tropical and subtropical climates, growing in well-drained, sandy soils with ample sunlight. The evergreen shrub prefers warm, humid conditions and is common in gardens, roadsides, and medicinal plantations. Nithyapushpa tolerates drought and poor soils, making it a resilient ornamental plant. In India, it’s grown for its attractive flowers and medicinal properties, often found in rural and urban landscapes.",
        "Diseases Treated": "Nithyapushpa is renowned in Ayurveda and modern medicine for its anticancer properties, treating leukemia and Hodgkin’s lymphoma due to alkaloids like vincristine. It’s used for diabetes management, lowering blood sugar levels. The leaves treat hypertension and improve cardiovascular health. In traditional medicine, Nithyapushpa is used for skin conditions like eczema and wounds, with antimicrobial effects. It aids digestion, relieving bloating, and is used for respiratory issues like asthma. The plant’s antioxidants boost immunity. However, its toxicity requires careful use under medical supervision.",
        "Preparation Methods": "Nithyapushpa leaves and roots are used under strict supervision due to toxicity. For diabetes, boil 5 grams of dried leaves in 200 ml water for a decoction, taken once daily with medical advice. For skin issues, apply a diluted leaf paste for 10 minutes. In Ayurveda, root extracts are used for cancer treatment, but only in pharmaceutical forms like vincristine. For hypertension, drink leaf tea (steep 3 leaves in 200 ml water) daily, under supervision. Store dried leaves in airtight containers. Consult a doctor, as improper use can cause severe side effects."
    },
    {
        "Plant Name": "Nooni",
        "Location": "Nooni (Morinda citrifolia), commonly known as noni, is native to Southeast Asia and Australasia, widely cultivated in India, especially in Kerala, Tamil Nadu, and coastal Karnataka. It thrives in tropical climates, growing in well-drained, sandy or loamy soils near coastlines or forests. The small tree prefers sunny, humid conditions with heavy rainfall, often found in home gardens and plantations. Nooni’s resilience to saline soils makes it ideal for coastal regions. In India, it’s grown for its fruit and medicinal uses, popular in Ayurvedic and traditional health practices.",
        "Diseases Treated": "Nooni is used in Ayurveda for its immune-boosting properties, treating infections and chronic fatigue. The fruit juice aids arthritis, reducing joint pain and inflammation. Nooni supports digestive health, relieving constipation and ulcers. It’s used for diabetes management, stabilizing blood sugar. The leaves treat skin conditions like boils and fungal infections due to antimicrobial properties. In traditional medicine, nooni juice is used for hypertension and heart health. Modern research suggests its potential for anticancer and antioxidant effects, though evidence is limited. It also promotes wound healing and general vitality.",
        "Preparation Methods": "Nooni fruit and leaves are used. For immunity, drink 10 ml of fermented fruit juice diluted in water daily. For arthritis, apply a leaf poultice for 20 minutes or drink leaf tea (steep 5 leaves in 200 ml water). For skin issues, apply crushed leaf paste for 15 minutes. In Ayurveda, fruit juice is mixed with honey for digestion, taken twice daily. For diabetes, consume 5 ml of juice under supervision. Store juice in a refrigerator and leaves in a cool place. Consult a doctor, as excessive use may cause liver issues."
    },
    {
        "Plant Name": "Pappaya",
        "Location": "Papaya (Carica papaya) is native to Central America but widely cultivated in India, particularly in Andhra Pradesh, Maharashtra, and Tamil Nadu. It thrives in tropical climates, growing in well-drained, loamy soils with moderate rainfall. The tree prefers sunny locations and is common in home gardens, farms, and commercial orchards. Papaya is grown for its fruit and medicinal leaves, with major production in southern and western India. Its fast growth and tolerance for warm, humid conditions make it a staple in rural and urban areas across the country.",
        "Diseases Treated": "Papaya fruit and leaves are used in Ayurveda for digestive health, treating constipation and intestinal worms due to the enzyme papain. The leaves aid dengue fever recovery, increasing platelet count. Papaya supports skin health, treating acne and wounds with its antimicrobial properties. It’s used for diabetes management, lowering blood sugar. The seeds have antiparasitic effects, treating worms. In traditional medicine, papaya boosts immunity and promotes heart health. Modern research suggests its potential for anticancer and anti-inflammatory effects, making it valuable for overall wellness.",
        "Preparation Methods": "Papaya fruit, leaves, and seeds are used. For digestion, eat ripe papaya daily or drink 10 ml of leaf juice twice daily. For dengue, boil 5 leaves in 200 ml water for a decoction, taken under supervision. For skin, apply a paste of unripe fruit for 15 minutes. In Ayurveda, ground seeds (1 gram) are taken with water for worms, once daily. For immunity, consume fruit juice. Store fresh leaves in a refrigerator and fruit in a cool place. Consult a doctor, as excessive leaf juice may cause stomach upset."
    },
    {
        "Plant Name": "Pepper",
        "Location": "Pepper (Piper nigrum), known as black pepper, is native to South India, thriving in tropical climates of Kerala, Karnataka, and Tamil Nadu. It grows as a climbing vine in well-drained, loamy soils with high humidity and moderate rainfall. Pepper prefers shaded areas, often cultivated with support trees in plantations. It’s a major commercial crop in the Western Ghats, with India being a global leader. The plant’s need for warm, moist conditions makes it ideal for South Indian farms and gardens, where it’s grown for culinary and medicinal uses.",
        "Diseases Treated": "Black pepper is used in Ayurveda for respiratory health, treating cough, asthma, and sinusitis due to its expectorant properties. It aids digestion, relieving bloating and constipation. Pepper’s piperine boosts metabolism, supporting weight loss and diabetes management. It’s used for skin infections, with antimicrobial effects. In traditional medicine, pepper treats fever and boosts immunity. Its anti-inflammatory properties help with arthritis. Modern research suggests anticancer and antioxidant potential, enhancing its value. Pepper is also used for oral health, reducing bad breath when chewed with betel leaves.",
        "Preparation Methods": "Peppercorns are used whole or ground. For respiratory issues, mix 1 gram of pepper powder with honey, taken twice daily. For digestion, add ground pepper to meals or drink a decoction (boil 2 grams in 200 ml water). For skin infections, apply a paste of pepper powder and ghee for 10 minutes. In Ayurveda, pepper is combined with turmeric for immunity, taken daily. For fever, drink pepper tea (steep 1 gram in 200 ml water). Store peppercorns in airtight containers. Consult a doctor, as excessive use may cause gastric irritation."
    },
    {
        "Plant Name": "Pomegranate",
        "Location": "Pomegranate (Punica granatum) is native to Persia and widely cultivated in India, particularly in Maharashtra, Gujarat, and Rajasthan. It thrives in semi-arid and subtropical climates, growing in well-drained, loamy soils with moderate rainfall. The shrub prefers sunny locations and is common in orchards, home gardens, and farms. Pomegranate is grown commercially for its fruit, with major production in western India. Its drought tolerance makes it ideal for dry regions, while its ornamental value enhances its presence in urban and rural landscapes across India.",
        "Diseases Treated": "Pomegranate fruit, rind, and leaves are used in Ayurveda for digestive health, treating diarrhea and dysentery due to astringent properties. It supports heart health, reducing cholesterol and blood pressure. The fruit’s antioxidants boost immunity and combat infections. Pomegranate is used for skin health, treating acne and aging signs. In traditional medicine, it treats intestinal worms and oral ulcers. The rind has antibacterial effects, aiding wound healing. Modern research suggests its potential for anticancer, anti-diabetic, and anti-inflammatory effects, making it a versatile medicinal plant for overall wellness.",
        "Preparation Methods": "Pomegranate fruit and rind are used. For diarrhea, drink a decoction (boil 5 grams of dried rind in 200 ml water) twice daily. For heart health, consume 100 ml of fruit juice daily. For skin, apply a paste of rind powder for 15 minutes. In Ayurveda, leaf tea (steep 5 leaves in 200 ml water) is used for oral ulcers, taken daily. For worms, take 1 gram of rind powder with honey. Store fruit in a refrigerator and rind in airtight containers. Consult a doctor, as excessive use may cause constipation."
    },
    {
        "Plant Name": "Raktachandini",
        "Location": "Raktachandini (Pterocarpus santalinus), known as red sandalwood, is native to South India, thriving in dry, deciduous forests of Andhra Pradesh, Tamil Nadu, and Karnataka. It grows in well-drained, sandy soils with low rainfall, preferring sunny, arid conditions. The tree is cultivated in plantations and protected forests due to its valuable wood and medicinal uses. Raktachandini’s slow growth and high demand make it rare, often found in controlled environments. In India, it’s grown for Ayurvedic medicine and cultural purposes, primarily in southern dry regions.",
        "Diseases Treated": "Raktachandini is used in Ayurveda for skin health, treating acne, eczema, and burns due to its cooling and antimicrobial properties. The wood powder reduces inflammation and joint pain in arthritis. It’s used for digestive issues, relieving ulcers and diarrhea. Raktachandini supports liver health, treating jaundice. In traditional medicine, it’s applied for wound healing and to improve complexion. The plant’s astringent properties help with excessive bleeding. Modern research suggests its potential for anti-diabetic and anticancer effects, though clinical use is limited due to its rarity.",
        "Preparation Methods": "Raktachandini wood powder is used. For skin issues, mix 5 grams of powder with honey to form a paste, apply for 15 minutes. For arthritis, massage a paste of powder and coconut oil into joints daily. For digestion, drink a decoction (boil 2 grams in 200 ml water) twice daily. In Ayurveda, wood powder is mixed with milk for liver health, taken daily. For wounds, apply diluted powder paste. Store powder in airtight containers. Consult a doctor, as overuse may cause skin dryness or allergic reactions."
    },
    {
        "Plant Name": "Rose",
        "Location": "Rose (Rosa species, e.g., Rosa damascena) is native to the Middle East but widely cultivated in India, particularly in Uttar Pradesh, Rajasthan, and Himachal Pradesh. It thrives in temperate and subtropical climates, growing in well-drained, loamy soils with moderate rainfall. The shrub prefers sunny locations and is common in gardens, farms, and perfume plantations. Roses are grown for their flowers, used in medicine and cosmetics. In India, they’re cultivated for cultural and medicinal purposes, with major production in northern plains and hilly regions.",
        "Diseases Treated": "Rose petals and oil are used in Ayurveda for skin and mental health. They treat acne and dry skin with hydrating and antimicrobial properties. Rose water soothes eye inflammation and improves complexion. The petals aid digestive health, relieving constipation and acidity. Rose oil reduces anxiety and depression, promoting relaxation. In traditional medicine, roses treat menstrual disorders and boost immunity. The hips are rich in vitamin C, treating scurvy. Modern research suggests antioxidant and anti-inflammatory effects, making roses valuable in aromatherapy and natural cosmetics.",
        "Preparation Methods": "Rose petals are used fresh or dried. For skin, apply rose water or a petal paste for 15 minutes daily. For anxiety, add 2 drops of rose oil to a diffuser. For digestion, drink rose tea (steep 5 petals in 200 ml water) twice daily. In Ayurveda, rose petal jam (gulkand) is taken (1 teaspoon) for acidity. For eyes, use rose water as an eye wash. Store petals in a refrigerator and oil in dark bottles. Consult a doctor, as excessive oil use may cause skin sensitivity."
    },
    {
        "Plant Name": "Sapota",
        "Location": "Sapota (Manilkara zapota), also known as chikoo, is native to Central America but widely cultivated in India, particularly in Maharashtra, Gujarat, and Karnataka. It thrives in tropical climates, growing in well-drained, loamy soils with moderate rainfall. The tree prefers sunny locations and is common in orchards, home gardens, and farms. Sapota is grown commercially for its fruit, with major production in western and southern India. Its tolerance for warm, humid conditions makes it a popular crop in rural and urban areas, valued for nutrition and medicinal uses.",
        "Diseases Treated": "Sapota fruit and leaves are used in traditional medicine for digestive health, treating diarrhea and constipation due to its fiber content. The fruit boosts immunity with its vitamin C and antioxidants, combating infections. Sapota leaves are used for oral health, reducing gum inflammation. In Ayurveda, it’s used for respiratory issues like cough and to promote wound healing. The fruit supports heart health, regulating blood pressure. Modern research suggests its potential for anti-inflammatory and anti-diabetic effects, though evidence is limited. Sapota is also used to improve energy and vitality.",
        "Preparation Methods": "Sapota fruit is eaten fresh, and leaves are used. For digestion, eat 1-2 ripe sapotas daily or drink leaf tea (steep 5 leaves in 200 ml water) twice daily. For oral health, chew fresh leaves or use a leaf decoction as a mouthwash. For wounds, apply a leaf paste for 15 minutes. In Ayurveda, fruit pulp is mixed with honey for immunity, taken daily. For respiratory issues, drink leaf juice (10 ml) with ginger. Store fruit in a cool place and leaves in a refrigerator. Consult a doctor for therapeutic use."
    },
    {
        "Plant Name": "Tulasi",
        "Location": "Tulasi (Ocimum sanctum), also known as holy basil, is native to India, thriving in tropical and subtropical climates. It’s widely cultivated in Uttar Pradesh, Tamil Nadu, and Karnataka, growing in well-drained, loamy soils with moderate rainfall. The herb prefers sunny locations and is common in home gardens, temples, and Ayurvedic plantations. Tulasi is grown for its sacred and medicinal leaves, revered in Indian culture. Its adaptability to various soils makes it a staple in rural and urban areas, often potted for daily use.",
        "Diseases Treated": "Tulasi is a cornerstone in Ayurveda for respiratory health, treating cough, asthma, and bronchitis with its expectorant properties. It boosts immunity, fighting infections and fevers. The leaves aid digestion, relieving bloating and ulcers. Tulasi is used for skin conditions like acne and fungal infections due to antimicrobial properties. It reduces stress and anxiety as an adaptogen. In traditional medicine, it treats diabetes and heart health. Modern research supports its anti-inflammatory, antiviral, and anticancer potential, making it a versatile herb for holistic wellness.",
        "Preparation Methods": "Tulasi leaves are used fresh or dried. For respiratory issues, drink a decoction (boil 5 leaves in 200 ml water) twice daily. For immunity, chew 3-4 leaves daily or drink leaf tea. For skin, apply a leaf paste for 15 minutes. In Ayurveda, leaf juice (10 ml) is mixed with honey for digestion, taken daily. For stress, inhale steam with crushed leaves. Store fresh leaves in a refrigerator and dried in airtight containers. Consult a doctor, as excessive use may lower blood sugar or cause mild dizziness."
    },
    {
        "Plant Name": "Wood_sorel",
        "Location": "Wood Sorrel (Oxalis corniculata) is native to Europe and Asia, widely naturalized in India, thriving in temperate and subtropical regions. It grows in Karnataka, Himachal Pradesh, and Tamil Nadu, found in gardens, wastelands, and shaded areas. The creeping herb prefers moist, well-drained soils and partial shade, tolerating moderate rainfall. Wood sorrel is often considered a weed but is cultivated for medicinal use. Its adaptability to various climates makes it common in rural and urban areas, especially in cool, hilly regions of India.",
        "Diseases Treated": "Wood sorrel is used in Ayurveda for digestive health, treating dysentery and bloating due to its astringent properties. It’s used for skin conditions like wounds and boils, with cooling and antimicrobial effects. The leaves aid fever reduction and boost immunity with high vitamin C content. In traditional medicine, wood sorrel treats scurvy and oral ulcers. It’s used for liver health, relieving jaundice. Modern research suggests its antioxidant and anti-inflammatory potential, though clinical use is limited. The plant also supports urinary health, acting as a mild diuretic.",
        "Preparation Methods": "Wood sorrel leaves are used fresh. For digestion, drink a decoction (boil 5 grams of leaves in 200 ml water) twice daily. For skin issues, apply a leaf paste for 15 minutes. For fever, consume leaf juice (10 ml) with honey daily. In Ayurveda, leaves are eaten raw for scurvy or mixed with buttermilk for liver health. For oral ulcers, chew fresh leaves. Store leaves in a refrigerator for up to a week. Consult a doctor, as excessive use may cause kidney issues due to oxalic acid."
    }
]